"""
Run this file as 

  python make_data.py
  
to produce dataset file <sna.csv>
"""


import io
import pandas as pd


def wrap(s: str):
    return io.StringIO(s.replace(",", "."))


# https://gks.ru/bgd/regl/b19_15/Main.htm
# счет товаров и услуг
doc1 = """коды	2014	2015	2016	2017	2018
P.1	132844907,0	145956162,4	153856534,7	166329337,9	185534251,4
P.7	16351535,5	17153423,3	17689044,9	19072953,0	21574303,8
D.21	10550847,8	8738499,6	8817205,9	9264512,5	11404173,9
D.31	258701,8	271647,2	278288,2	318752,7	327900,9
	159488588,5	171576438,1	180084497,3	194348050,7	218184828,2
P.2	64078569,0	71328710,2	76381248,1	83173749,9	92734724,0
P.3	56418220,9	58240533,5	61389774,1	65165442,1	69332988,5
P.5	17883660,1	18603397,9	20242855,7	22189209,6	23611223,6
P.6	21425934,6	23854056,5	22137648,3	23994306,3	31932556,0
desc	-317796,1	-450260,0	-67028,9	-174657,2	573336,1
	159488588,5	171576438,1	180084497,3	194348050,7	218184828,2
"""

# cчет образования доходов
doc2 = """коды	2014	2015	2016	2017	2018
B.1*g 	79058484,0	83094304,6	86014204,3	92101347,8	103875800,4
	79058484,0	83094304,6	86014204,3	92101347,8	103875800,4
D.1	37430458,0	39745493,0	41245363,8	43884319,8	48244368,2
	10555077,0	11199588,4	11192278,7	11923443,1	13062566,5
D.2	11497946,7	9787221,1	9942260,5	10508160,8	12769698,8
D.21	10550847,8	8738499,6	8817205,9	9264512,5	11404173,9
D.29	947098,9	1048721,5	1125054,6	1243648,3	1365524,9
D.3	493706,9	516204,9	523413,9	522587,5	544797,6
D.31	258701,8	271647,2	278288,2	318752,7	327900,9
D.39	235005,1	244557,7	245125,7	203834,8	216896,7
B.2g+       B.3g	30623786,2	34077795,4	35349993,9	38231454,7	43406531,0
	79058484,0	83094304,6	86014204,3	92101347,8	103875800,4"""


renamer = {
    "P.1": ("Output", "Xb"),
    "P.7": ("Imports of goods and services", "IM"),
    "D.21": ("Taxes on products", "Tp"),
    "D.31": ("Subsidies on products", "Sp"),
    "P.2": ("Intermediate consumption", "AX"),
    "P.3": ("Final consumption expenditure", "C"),
    "P.5": ("Gross capital formation", "I"),
    "P.6": ("Exports of goods and services", "EX"),
    "desc": ("Statistic descrepancy", "desc"),
    "B.1*g ": ("Gross domestic product in market prices", "GDP"),
    "D.1": ("Employee compensation", "W"),
    "D.2": ("Taxes on production and import", "Tf"),
    "D.3": ("Subsidies on production and import", "Sf"),
    "B.2g+       B.3g": ("Gross operating surplus and gross mixed income", "GP"),
}

items = [
    # ("Output", "P.1", "Xb", ""),
    # ("Imports of goods and services", "P.7", "IM", ""),
    # ("Taxes on products", "D.21", "Tp", ""),
    # ("Subsidies on products", "D.31", "Sp", ""),
    # ("Intermediate consumption", "P.2", "AX", ""),
    # ("Final consumption expenditure", "P.3", "C", ""),
    # ("Gross capital formation", "P.5", "I", ""),
    # ("Exports of goods and services", "P.6", "EX", ""),
    # ("Statistic descrepancy", "desc", "desc", ""),
    # ("Gross domestic product in market prices", "B.1*g ", "GDP", ""),
    # ("Employee compensation", "D.1", "W", ""),
    # ("Taxes on production and import", "D.2", "Tf", ""),
    # ("Subsidies on production and import", "D.3", "Sf", ""),
    (
        "Валовая прибыль экономики и валовые смешанные доходы "
        "Gross operating surplus and gross mixed income",
        "B.2g+B.3g",
        "GP",
        "30623786,2	34077795,4	35349993,9	38231454,7	43406531,0",
    ),
    (
        'Доходы от собственности, полученные от "остального мира"',
        "D.4",
        "ROW_property_income_recieved",
        "1622955,0	2070853,7	2460666,6	2481226,8	3071599,9",
    ),
    (
        'Доходы от собственности, переданные "остальному миру"',
        "D.4",
        "ROW_property_income_paid",
        "3815331,9	3933121,8	4676138,0	4797296,7	5488729,5",
    ),
    (
        "Gross national income",
        "B.5*g",
        "GNI",
        "76484974,0	80924721,9	83678514,0	89652433,3	101267354,6",
    ),
    (
        "Cальдо заработной платы, полученной за границей и выплаченной в России "
        "нерезидентам",
        "",
        "ROW_wage_net",
        "-381133,2	-307314,6	-120218,9	-132844,6	-191316,2",
    ),
    #  СЧЕТ ВТОРИЧНОГО РАСПРЕДЕЛЕНИЯ ДОХОДОВ
    (
        "Валовой национальный доход",
        "B.5*g",
        "GNI",
        "76484974,0	80924721,9	83678514,0	89652433,3	101267354,6",
    ),
    (
        'Текущие трансферты, полученные от "остального мира"',
        "D.61+D.7",
        "CT_recieved",
        "671576,6	603548,1	573412,4	615631,1	734035,0",
    ),
    (
        'Текущие трансферты, переданные "остальному миру"',
        "D.62+D.7",
        "CT_paid",
        "986460,0	954780,1	990384,5	1140312,5	1317584,0",
    ),
    (
        "Валовой располагаемый доход",
        "B.6*g",  # ERROR: было 'B.6*n'
        "GDI",
        "76170090,6	80573489,9	83261541,9	89127751,9	100683805,6",
    ),
    # СЧЕТ ИСПОЛЬЗОВАНИЯ РАСПОЛАГАЕМОГО ДОХОДА
    (
        "Расходы на конечное потребление домашних хозяйств",
        "P.3",
        "HH1",
        "41954831,1	43242320,3	45317053,8	48135665,4	50851055,8",
    ),
    (
        "Расходы на конечное потребление государственного управления",
        "P.32",
        "G",
        "14173198,5	14684126,2	15728490,9	16649198,2	18049306,7",
    ),
    (
        "Расходы на конечное потребление "
        "некоммерческих организаций, обслуживающих домашние хозяйства",
        "P.3",
        "HH2",
        "290191,3	314087,0	344229,4	380578,5	432626,0",
    ),
    (
        "Валовое сбережение",
        "B.8*g",
        "S",
        "19751869,7	22332956,4	21871767,8	23962309,8	31350817,1",
    ),
    # CЧЕТ ОПЕРАЦИЙ С КАПИТАЛОМ
    # Gross capital formation comprise:
    # - Gross fixed capital formation (P.51)
    # - Changes in inventories (P.52)
    # - Acquisitions less disposals of valuables (P.53)
    (
        'Капитальные трансферты, полученные от "остального мира"',
        "D.9",
        "d9_recieved",
        "16942,4	18501,4	65467,8	28698,6	13617,9",
    ),
    (
        'Капитальные трансферты, переданные "остальному миру"',
        "D.9",
        "d9_paid",
        "1868686,4	33892,6	116572,2	37444,9	80107,0",
    ),
    (
        "Валовое накопление основного капитала",
        "P.51+P.53",
        "GFCF",
        "17115121,0	17325846,7	18910543,3	20571118,7	22237431,5",
    ),
    (
        "Изменение запасов материальных оборотных средств",
        "P.52",
        "inv",
        "768539,1	1277551,2	1332312,4	1618090,9	1373792,1",
    ),
    (
        "Приобретение за вычетом выбытия непроизведенных нефинансовых активов",
        "K.2",
        "k2",
        "10304,9	2841,4	934,4	2270,5	4316,8",
    ),
    (
        "Чистое кредитование (+), чистое заимствование (-) и статистическое расхождение",
        "B.9",
        "NL0",
        "6160,7	3711325,9	1576873,3	1762083,4	7668787,6",
    ),
]


def index():
    return [str(year) for year in range(2014, 2019)]


def get_ts(item) -> pd.Series:
    ts = (
        pd.read_csv(io.StringIO(item[3]), header=None, sep="\t", decimal=",")
        .transpose()
        .iloc[:, 0]
    )
    ts.index = index()
    ts.name = item[2]
    return ts


def to_variables(code):
    try:
        return renamer[code][1]
    except KeyError:
        return code


def get_df(doc):
    return (
        pd.read_csv(wrap(doc), sep="\t")
        .set_index("коды")
        .transpose()
        .rename(to_variables, axis=1)
        .applymap(float)
    )


df1 = get_df(doc1)[["Xb", "IM", "Tp", "Sp", "AX", "C", "I", "EX", "desc"]]
df2 = get_df(doc2)[["GDP", "Tf", "Sf", "W", "GP"]]
for item in items:
    get_ts(item)
df_last = pd.concat(map(get_ts, items), axis=1)
df = pd.concat([df1, df2, df_last], axis=1)
df["HH"] = df.HH1 + df.HH2
df.to_csv("sna.csv")
